[
  "This document is provided for the application for Halal Certification by the Majlis Ugama Islam Singapura with effect from 1 October 2025. The Eating Establishment scheme (Category 1) is applicable to the operation of the following types of retail food establishments in Singapore: Hawker Stalls, Snack bars / Bakeries, School Canteen Stalls, Short-term Stalls.\nAll companies / establishments applying for a Halal certification from Majlis Ugama Islam Singapura (MUIS) must comply with the MUIS Halal Certification Conditions.\nThe applicant shall read, understand and agree to adhere to the MUIS Halal Certification Conditions upon submission of the application. The applicant shall ensure that there is no cross-mixing of Halal and non-Halal food and ingredients. The applicant shall engage at least 1 permanent Muslim personnel.\nThe processing of application shall commence within 14 working days from the date of payment for New (normal) processing application. The applicant shall submit a New application if its current outlet has not been previously Halal-certified by MUIS.\nMUIS reserves the right to suspend or revoke the Halal certificate with immediate effect upon acknowledgement / written notice to the certificate holder if any conditions are breached.\nURL: https://file.go.gov.sg/hcc-eec1.pdf",
  "This document is provided for the application for Halal Certification by the Majlis Ugama Islam Singapura with effect from 01 October 2025.\nCompanies applying for Halal certification must comply with MUIS Halal Certification Conditions.\nThe applicant shall read, understand and agree to adhere to the MUIS Halal Certification Conditions upon submission of the application. The applicant shall ensure that there is no cross-mixing of Halal and non-Halal food and ingredients.\nThe processing of application shall commence within 14 working days from the date of payment for New (normal) application; within 7 working days from the date of payment for New (express) application.\nMUIS may conduct unannounced periodic inspections as and when necessary following the award of the Halal certificate.\nURL: https://file.go.gov.sg/hcc-pwp.pdf",
  "The Poultry scheme shall be applicable to selected fresh whole poultry which is slaughtered in Singapore. The scope of certification shall include: (a) poultry feed; (b) transporting, receiving, stunning, slaughtering, scalding, de-feathering, evisceration, labelling, sorting and storage of poultry.\nThe Poultry scheme is specifically for fresh whole poultry slaughtered in Singapore.\nThe applicant shall ensure and provide documentation to prove the poultry are grain/corn fed and not injected with any hormones while breeding. The applicant shall also apply for additional schemes if processing, packing, or selling cut poultry pieces.\nThe processing of application shall commence within 14 working days from the date of payment for New (normal) processing application. The applicant must access the application portal regularly for information on application status and be prepared for a site audit by MUIS after operations commence.\nThe Halal certificate is valid for the period stipulated on the certificate and shall not be displayed outside the certified premises.\nURL: https://file.go.gov.sg/hcc-pa.pdf",
  "The Endorsement scheme shall be applicable to: 1. Imported finished product for sale in as-is condition, in respect of which a Halal certificate has been issued by MUIS-recognised foreign Halal certification body; 2. Exporting Singapore origin, finished product, in respect of which a Halal certificate has been issued by MUIS; 3. Exporting in as-is condition, imported finished product, in respect of which a Halal certificate has been issued by a foreign Halal certification body that is recognised by MUIS and the exporting country.\nThe Endorsement scheme is required for specific products to ensure compliance with Halal standards.\nThe applicant shall be adequately licensed by the competent food safety authority; ensure no cross-mixing of Halal and non-Halal food; all products in the shipment applied for Halal Endorsement shall be Halal-certified by MUIS or MUIS-recognised Halal certification bodies.\nNew application submission shall be made 14 or 7 working days prior to the scheduled departure/arrival of products from/into Singapore.\nThe Halal endorsement letter is valid until the expiry of product(s) in the respective shipment and is not renewable.\nURL: https://file.go.gov.sg/hec-en.pdf",
  "This document is provided for the application for Halal Certification by the Majlis Ugama Islam Singapura with effect from 01 October 2025. The Storage Facility scheme shall be applicable to storage facility, warehouse, dishwashing facility or any section thereof in Singapore.\nHalal certification is required for storage facilities handling Halal products.\nThe applicant shall ensure that there is no cross-mixing of Halal and non-Halal food and ingredients. The applicant shall engage at least 1 permanent Muslim personnel, appointed as the Halal Assurance Officer.\nThe applicant shall submit a New application if its current location has not been previously Halal-certified by MUIS or if there is a change in ownership, name, or address of certified premises.\nMUIS may conduct unannounced periodic inspections as necessary following the award of the Halal certificate.\nURL: https://file.go.gov.sg/hcc-sf.pdf",
  "This document is provided for the application for Halal Certification by the Majlis Ugama Islam Singapura with effect from 01 October 2025. The Food Preparation Area scheme shall be applicable to catering companies, central kitchen facilities, and pre-school kitchens.\nThe Halal certification is required for food preparation areas to ensure compliance with Muslim law.\nThe applicant must comply with MUIS Halal Certification Conditions, including having a Halal team, ensuring no cross-mixing of Halal and non-Halal food, and maintaining proper documentation.\nApplicants must submit a New application if their outlet has not been previously Halal-certified, or if there are changes in ownership or business details. The application process includes site audits and compliance checks.\nThe Halal certificate is valid for the period stipulated on the certificate and must not be displayed beyond its expiry date.\nURL: https://file.go.gov.sg/hcc-fpa.pdf",
  "Businesses that want to import animal feed for food-producing animals (e.g. live chickens and fish) must register with SFA and obtain a Cargo Clearance Permit (CCP) issued by Singapore Customs for each consignment.\nRegistration is required to ensure compliance with food safety regulations.\nMust be registered with ACRA, activate UEN with Singapore Customs, set up a GIRO arrangement with SFA, and ensure animal feed complies with SFA’s requirements.\nLog into the GoBusiness portal to submit your Registration to Import Animal Feed. Complete applications are processed within 1 working day.\nAnimal feed sold in Singapore must be packaged and labelled in English, with specific information indicated on the packaging.\nURL: https://www.sfa.gov.sg/food-import-export/commercial-imports/what-you-need-to-know-for-import-of-animal-feed",
  "Businesses that want to export or tranship animal feed for food-producing animals must have a Cargo Clearance Permit (CCP) for each consignment. The CCP is equivalent to a SFA export or transhipment permit granted by SFA.\nA Cargo Clearance Permit (CCP) is required for exporting or transhipping animal feed.\nRegistration with ACRA is mandatory, and your UEN must be activated with Customs. If the animal feed is regulated by SFA, a GIRO arrangement with SFA must be set up.\nApply for a Cargo Clearance Permit (CCP) through TradeNet for each consignment. Ensure correct HS codes and attach supporting documents.\nApproval by SFA is processed within 1 working day. Fees for animal feed are $22 per consignment.\nURL: https://www.sfa.gov.sg/commercial-exports/what-you-need-to-know-for-export-tranship-of-animal-feed",
  "Licence for Import/Export/Transhipment of Meat and Fish Products is required if Traders involved in the import/export/transshipment of meat and fish products.\nTraders involved in the import/export/transshipment of meat and fish products require this licence.\n1. Top Up CPF MediSave. 2. Activate UEN with Singapore Customs. 3. Submit original GIRO form.\nApply as a Business User with a UEN-registered company/entity or as a Third Party Filer for Business. Estimated processing time is 1 working day.\nLicence Fee: $84.00. Payment Methods: American Express, Diners Club, JCB, Mastercard, UnionPay, Visa, PayNow, GIRO.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/licence-for-importexporttranshipment-of-meat-and-fish-products",
  "Licence for Import/Transhipment of Fresh Fruits and Vegetables is required if Traders involved in the import/transshipment of fresh fruits and vegetables.\nTraders involved in the import/transshipment of fresh fruits and vegetables must obtain this licence.\n1. Top Up CPF MediSave. 2. Activate UEN with Singapore Customs. 3. Submit original GIRO form.\nApplication is available for third party filers. Estimated processing time is 1 working day. 30 minutes to complete.\nLicence Fee: $378.00. Payment Methods: American Express, Diners Club, JCB, Mastercard, UnionPay, Visa, PayNow, GIRO.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/licence-for-importtranshipment-of-fresh-fruits-and-vegetables",
  "The Licence to Import Poultry is issued to importers by Singapore Food Agency to import Broiler Chickens and Broiler Ducks.\nThis licence is required for businesses importing poultry products.\nBusiness User: A UEN-registered company/entity with Corppass. No supporting documents required.\nEstimated processing time is 1 working day. Apply on GoBusiness. For enquiries, contact the agency at https://www.sfa.gov.sg/contact-us.\nApplication is not available for third party filers.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/licence-to-import-poultry",
  "The Licence to Import Sheep and Goats is issued to importers by Singapore Food Agency to import Sheep and Goats.\nThis licence is required for businesses looking to import sheep and goats into Singapore.\nYou may apply as a Business User: A UEN-registered company/entity with Corppass. Prerequisite Licence(s): ACRA - Registration for Companies / Business.\nEstimated processing time is 1 working day. 30 minutes to complete. You may refer below for the guide on the steps for application.\nApplication is not available for third party filers.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/licence-to-import-sheep--goats",
  "The Licence to Import Table Eggs is issued to importers by Singapore Food Agency to import Table Eggs.\nThis licence is required for businesses looking to import table eggs into Singapore.\nEligibility Requirements: A UEN-registered company/entity with Corppass. Prerequisite Licence(s): ACRA - Registration for Companies / Business, SFA - Licence to Operate a Food Processing Establishment.\nEstimated processing time is 1 working day if application is complete and in order. 30 minutes to complete. Apply on GoBusiness.\nYou may not be required to attach any documents to submit this application. The agency will contact you should they require any documents from you.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/licence-to-import-table-eggs",
  "The Licence to Import/Export/Transship Animals, Birds, Eggs and Biologics is issued by Singapore Food Agency. This licence is required if you intend to import/export/tranship animals, birds or their products into/out from Singapore.\nThis licence is required for importing/exporting/transhipping animals, birds, or their products.\nYou may apply as a Business User: A UEN-registered company/entity with Corppass. Prerequisite Licence(s): ACRA - Registration for Companies / Business.\nEstimated processing time is 1 working day. Application is not available for third party filers. Apply on GoBusiness.\nYou may not be required to attach any documents to submit this application. The agency will contact you should they require any documents from you.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/licence-to-importexporttranship-food-animals-birds-eggs-and-biologics",
  "The Registration to Import Feed for Food Producing Animals is issued by Singapore Food Agency. This registration is issued to importers to import animal feed.\nThis registration is required for importers to import animal feed for food-producing animals.\nYou may apply as a Business User: A UEN-registered company/entity with Corppass.\nEstimated processing time is 1 working day. 30 minutes to complete. Apply on GoBusiness.\nYou may not be required to attach any documents to submit this application. The agency will contact you should they require any documents from you.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/registration-to-import-feed-for-food-producing-animals",
  "The Registration to Import Feed for Food Producing Animals is issued by Singapore Food Agency. This registration is issued to importers to import animal feed.\nThis registration is required for importers to import animal feed for food-producing animals.\nYou may apply as a Business User: A UEN-registered company/entity with Corppass.\nEstimated processing time is 1 working day. 30 minutes to complete. Apply on GoBusiness.\nYou may not be required to attach any documents to submit this application. The agency will contact you should they require any documents from you.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/registration-to-import-feed-for-food-producing-animals",
  "A licence issued by the Singapore Food Agency (SFA) is required to import (into Singapore or Singapore Free Trade Zone), export and carry out wholesale dealings in rice.\nA licence is required to import, re-export and carry on wholesale dealings in rice.\nYou may apply as a Business User: A UEN-registered company/entity with Corppass.\nEstimated processing time is 3 working days upon receipt of completed application. Applicant will be notified through email upon successful processing of their application within 3 working days.\nYou may not be required to attach any documents to submit this application. The agency will contact you should they require any documents from you.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/rice-licence",
  "Food Shops include bakeries, restaurants, food vending machines, canteens, coffee shops, eating houses, food courts, standalone kiosks, takeaway food carts, and private canteens/markets.\nFood Shops must have a Food Shop Licence to operate.\nThe requirements and conditions for Food Shop Licences can be found in the Food Shop Self-Checklist. Operators of Food Shops offering self-service buffets must provide hand sanitisers or disposable gloves.\nSingapore citizens, permanent residents, societies registered with MHA, or entities registered with ACRA can apply for this licence.\nSpecific types of Food Shops, such as Pet Cafes, Mobile Food Wagons, and Mini Restaurants have specific requirements.\nURL: https://www.sfa.gov.sg/food-retail/licence-permit/requirements-for-licence-permit-for-food-retail",
  "Temporary Fairs are events where stalls sell merchandise, food or drinks. To operate such fairs, you must have a permit from SFA.\nOperating Temporary Fairs illegally without a valid permit is an offence.\nYou must submit your application at least 2 weeks before the fair start date and provide necessary documents including a layout plan and support documentation.\nYou must have CorpPass or SingPass to submit the application for a permit.\nOperators are required to comply with the Environmental Public Health (Food Hygiene) Regulations.\nURL: https://www.sfa.gov.sg/food-retail/licence-permit/requirements-for-licence-permit-for-food-retail",
  "All types of food businesses, whether online or physical, must comply with prevailing food laws and regulations. This also applies to food businesses that do not require a licence from SFA to operate, such as e-commerce platforms and organisers of group buys.\nE-commerce platforms and organisers of group buys do not require a licence to operate.\nMust comply with prevailing food laws and regulations.\nFor more details, see Requirements for Online Food Sellers.\nSFA has developed industry standards for the sale of food products on online platforms and delivery of RTE food.\nURL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/online-food-businesses/types-of-online-food-businesses",
  "The Home-based Business Scheme enables anyone to run a small-scale business, including a food business, from their home, provided they comply with the requirements and conditions.\nThis scheme allows home-based businesses to operate without requiring approval from the HDB or Urban Redevelopment Authority (URA), provided they meet all the scheme's requirements.\nAll home-based food businesses must comply with food rules and regulations and follow the guidelines on good food safety practices provided by SFA.\nFor more details, see: Requirements for Home-based Food Businesses.\nHome-based food businesses are not allowed to sell their food to food retailers and should not offer ready-to-eat raw seafood.\nURL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/home-based-food-businesses/about-hdb-ura-home-based-business-scheme",
  "Food delivery businesses, although not required to obtain a licence from the SFA to operate, still have legal responsibilities and must comply with food safety laws and regulations.\nFood delivery businesses do not require a licence from the SFA to operate.\nOperators must ensure that the way in which food is delivered to customers does not compromise food safety.\nFood delivery service providers can follow the Guidelines on the delivery of RTE food (Singapore Standard SS 672:2021).\nThe standard is not mandatory but helps improve food safety and maintain the quality and integrity of food products.\nURL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/food-delivery-businesses/requirements-for-food-delivery-businesses",
  "Group buys are private arrangements among members of a group and do not require a licence from SFA. For example, when you gather a few friends and place an order with a licensed food supplier in Singapore to get a better price, you do not need a licence.\nGroup buying is a type of online food business where an organiser buys food in bulk for group members to get lower prices or other perks.\nEvery food business, no matter how small or informal, must follow the prevailing food safety laws to ensure that food is safe for everyone.\nEducate and raise awareness among your group members about the need to practise good food safety practices.\nCertain activities involving food products require a licence from SFA, such as importing meat to sell.\nURL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/group-buy-activities/guidelines-for-group-buy-organisers",
  "For the operation of a food shop where there is retail sale of food and/or beverage. You will need to apply for a Food Shop Licence if you intend to operate a retail food outlet where food and/or drink are sold wholly by retail.\nThe purpose of licensing is to ensure cleanliness and food safety in food retail outlets and to prevent food-borne diseases.\nComplete all fields on the application form, submit the layout plan with specified details, and obtain In-Principle Approval before renovation.\nApply on GoBusiness, obtain In-Principle Approval, commence renovation, request for inspection, and complete payment for licence.\nEstimated processing time is 7 working days if application is complete and in order. The licence costs S$195.00 and is valid for one year.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/food-shop-licence",
  "For the operation of a foodstall where there is retail sale of food and/or beverage in a foodshop such as private eating houses, coffeeshops, food courts, canteens and private markets.\nA hawker stall licence is required to operate a food stall in NEA managed food centres/markets.\nSubmit application in GoBusiness, tenancy/lease agreement with Certificate of Stamp Duty, layout plan of the stall, and Food Safety Course Level 1 certificate.\nApply through GoBusiness, ensure all documents are complete, and payment must be made within 28 days after notification.\nValidity is 1, 2, or 3 years; fees vary based on stall location.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/food-stall-licence",
  "For the operation of a supermarket with the sale/preparation of raw food. The purpose of licensing is to ensure cleanliness and food safety in supermarkets and to prevent food-borne diseases.\nA Supermarket Licence is required for the operation of a supermarket with the sale/preparation of raw food.\nComplete all fields on the application form, submit the layout plan with provision of a metric scale, indication of kitchen equipment, and boundaries of refreshment area. Obtain In-Principle Approval before renovation.\nStep 1: Obtain In-Principle Approval. Step 2: Commence Renovation & Set-up. Step 3: Request for Inspection. Step 4: Complete Payment for Licence.\nEstimated processing time is 7 working days if application is complete and in order. Valid for 1 year. Fee: $250.00 for less than 200 square metres, $500.00 for more than 200 square metres.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/supermarket-licence",
  "A Permit for Temporary Fair is required for all temporary set ups with makeshift stalls selling food, beverages and/or goods.\nUnder the Environmental Public Health Act, all operators of temporary fairs must get a permit from SFA for the duration of the fair.\nLetter of appointment Site use approval Support documentation (e.g. consensus from shopkeepers’/merchants’ association) Layout plan detailing stalls with food handling and their necessary infrastructure Completed declaration form\nApplicants should log in to GoBusiness Licensing website as Business User or SingPass. Applications must be submitted at least 2 weeks before the fair commencement date.\nOperating temporary fairs illegally without a valid permit is an offence. Offenders are liable to fines or imprisonment.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/permit-for-temporary-fair",
  "This licence is only for stalls within temporary fairs that conduct handling or preparation of food for sale. There is no separate fee for this licence, and it is valid only during the fair duration.\nThis licence is required for stalls that handle or prepare food for sale at temporary fairs.\nA photocopy of food handler’s WP, Food Safety Course Level 1 certificate, a copy of lease contract with temporary fair organiser, and other supporting documents.\nEstimated processing time is 3 working days if application is complete and in order. Apply on GoBusiness.\nNo licence is needed for stalls that sell non-food items or pre-packed food items from SFA-licensed food processing establishments, food retail establishments, or importers.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/temporary-fair-stall-licence",
  "All food processing establishments must be licensed before they manufacture, process, prepare, or package food for distribution to wholesalers and retailers.\nIt is an offence under the prevailing food safety laws to carry out the above activities without a valid SFA licence/registration.\nApplicants must comply with general requirements, prevailing food safety laws, and licensing conditions.\nFor details on the application process, see Application Process & Fees for Licence / Registration for Food Manufacturing & Storage.\nFood processing establishments are not permitted to manufacture or store feed for non-food producing animals.\nURL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "All coldstores for meat and seafood products must be licensed before they store food for wholesale distribution.\nIt is an offence under the prevailing food safety laws to carry out the above activities without a valid SFA licence/registration.\nApplicants must comply with general requirements, prevailing food safety laws, and licensing conditions.\nFor details on the application process, see Application Process & Fees for Licence / Registration for Food Manufacturing & Storage.\nThis licence is for storage only. There must not be any processing or retail activities.\nURL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "All slaughterhouses for poultry and livestock must be licensed before they slaughter, process, prepare, package, or store food for distribution to wholesalers or retailers.\nIt is an offence under the prevailing food safety laws to carry out the above activities without a valid SFA licence/registration.\nApplicants must comply with general requirements, prevailing food safety laws, and licensing conditions.\nFor details on the application process, see Application Process & Fees for Licence / Registration for Food Manufacturing & Storage.\nThis licence is required for slaughterhouses only.\nURL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "In Singapore, all cold stores for meat & seafood products must be licensed by the Singapore Food Agency before they are permitted to carry out any storage for wholesale distribution.\nCold stores for meat & seafood products require licensing to operate legally.\nLocated in areas designated for food use; Prerequisite Licence(s): ACRA - Registration for Companies / Business.\nEstimated processing time is An estimated 25 working days to process an application depending on the completeness of documents submitted in order to issue in principle approval (IPA).\nApplication is available for third party filers (Business).\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/licence-to-operate-a-coldstore",
  "In Singapore, all food processing establishments must be licensed by Singapore Food Agency before they are permitted to carry out any food processing for wholesale distribution.\nAll food processing establishments must be licensed by SFA.\nLocated in areas designated for food use; Prerequisite Licence(s): ACRA - Registration for Companies / Business.\nApply as a Business User with a UEN-registered company/entity with Corppass or as a Third Party Filer for Business.\nEstimated processing time is 25 working days depending on document completeness.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/licence-to-operate-a-food-processing-establishment",
  "In Singapore, all slaughter-houses must be licensed by the Singapore Food Agency before they are permitted to carry out any food processing or storage for wholesale distribution.\nAll slaughter-houses must be licensed to operate legally.\nLocated in areas designated for food use; Prerequisite Licence(s): ACRA - Registration for Companies / Business.\nEstimated processing time is 25 working days; Apply on GoBusiness.\nApplication is available for third party filers.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/licence-to-operate-slaughter-house",
  "In Singapore, all food storage warehouse must be licensed by the Singapore Food Agency before they are permitted to carry out any storage for wholesale distribution.\nAll food storage warehouses must be licensed by the SFA.\nACRA - Registration for Companies / Business.\nEstimated processing time is An estimated 25 working days to process and issue new licence. Apply on GoBusiness.\nNo supporting documents required. The agency will contact you should they require any documents from you.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/registration-of-food-storage-warehouses",
  "You must have a SFA licence to manufacture or process animal feed for food-producing animals. This includes livestock feed and aquaculture feed.\nAll local producers of animal feed for food-producing animals must be licensed by SFA before commencing feed production.\nMust be registered with ACRA and have a UEN. Active CorpPass account required.\nSubmit licence application and business proposal via GoBusiness portal. Apply for pre-licensing inspection after establishment setup. Sign up for GIRO for fee payments.\nLicence is valid for 1 year. No application fee, but a $240 annual licence fee applies.\nURL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/application-process-fees-for-licence-to-manufacture-and-process-animal-feed",
  "All local commercial producers of animal feed for food producing animals must get a Singapore Food Agency (SFA)’s issued licence before they can manufacture and process animal feed. This includes livestock feed and aquaculture feed.\nLocal commercial producers of animal feed must obtain this licence to operate legally.\nApproval document for use of Premises and waste disposal (URA, HDB / JTC, NEA / SFA), Layout plan of production area, Flow Chart of manufacturing/processing steps, Labelling, Standard Operation Procedure.\nEstimated processing time is 25 working days. Application is available for third party filers. Apply on GoBusiness.\nLicence Fees: $240.00. Payment Methods: American Express, Diners Club, JCB, Mastercard, UnionPay, Visa, PayNow, GIRO.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/licence-to-manufacture-animal-feed-and-process-of-animal-feed-for-food-producing-animals",
  "Land-based farms for keeping, rearing, or breeding animals or birds, or cultivating plants, for commercial food production e.g. dairy farms, layer farms, mushroom farms, urban farms, and vegetable farms.\nTo carry out farming activities regulated by SFA, you must have the required licence/registration.\nEligibility requirements can be checked under Requirements for Licence for Farming.\nFor details on how to apply, see Application Process & Fees for Licence for Farming.\nFees for Farm Licence is $100 per year.\nURL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-farming",
  "Servicing fish culture farms.\nTo carry out fishing activities regulated by SFA, you must have the required licence/registration.\nEligibility requirements can be checked under Requirements for Licence for Fishing Vessel, Gear & Personnel.\nFor details on how to apply, see Application Process & Fees for Licence / Registration of Fishing Vessel.\nFees for Fishing Vessel Licence vary based on the type of vessel.\nURL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-fishing-vessel-gear-personnel",
  "Sea-based fish culture farms for commercial production e.g. fish farms and shrimp farms.\nTo carry out fish culture activities regulated by SFA, you must have the required licence/registration.\nEligibility requirements can be checked under Requirements for Licence for Fish Culture Farm.\nFor details on how to apply, see Application Process & Fees for Licence for Fish Culture Farm.\nFees for Fish Culture Farm Licence is $145 per year.\nURL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-fish-culture-farm",
  "Licensed farms are only permitted to use agricultural pesticides that are registered with SFA. Registered pesticides can only be applied by certified pesticide operators.\nAll farm licensees are required to comply with the usage requirements for agricultural pesticides.\nUse only registered agricultural pesticides. Never use or store non-agricultural pesticides on your farm. Pesticides must be applied by certified pesticide operators. Always ensure pesticide residue is within limits. Keep records of pesticide use. Dispose of unused pesticides and empty pesticide receptacles safely. Requirements apply also to pesticide-free or chemical-free farms.\nFarm licensees can contact their Account Manager or use the SFA Online Feedback Form for more information.\nSFA ensures compliance through a surveillance regime and will take action against any infringements.\nURL: https://www.sfa.gov.sg/farming/pesticides/requirements-for-pesticide-usage-in-farms",
  "All inboard fishing vessels and fishing equipment onboard must be licensed by SFA. Individuals employed or engaged in any activity on a fishing vessel must also be registered.\nOperating a fishing vessel without a licence is an offence.\nAll inboard fishing vessels need to be licensed; new fishing gear onboard fishing vessels need to be licensed; employees and individuals engaged in any activity on fishing vessels must be registered.\nFor details on how to apply, see Application Process & Fees for Licence / Registration of Fishing Vessel, Fishing Gear, Persons Engaged or Employed on Fishing Vessel, Entry Permit and Port Clearance/Report of Arrival at SFA Fishery Ports.\nFees vary based on the type of fishing vessel and registration.\nURL: https://www.sfa.gov.sg/wholesale-markets-fishery-ports/licence-registration/businesses-that-need-licence-registration-for-fishing-vessel-gear-personnel",
  "The Health Certificate for Export of Live Foodfish is issued by Singapore Food Agency that allows exporters to export live food fish for farming.\nThis licence is required for exporting live food fish.\nEligibility Requirements: A UEN-registered company/entity with Corppass. Prerequisite Licence(s): ACRA - Registration for Companies / Business.\nApply on GoBusiness. Estimated processing time is Normal: 3 working days, Express: 1 working day. You may withdraw your application at any time after submitting.\nWith effect from 14 April 2025, exporters are required to install the new Digital Document Reader (DDR) software to preview the watermarked certificates for printing.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/health-certificate-for-export-of-live-foodfish-for-breeding",
  "The Export Health Certificate is issued to traders, to certify a food consignment as fit for human consumption, and meeting safety standards or other required criteria to facilitate the export of this food consignment. This certificate is only issued for food consignments manufactured or processed or packed in a food processing establishment licensed by Singapore Food Agency.\nThis certificate is required for exporting food consignments.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business.\nYou may apply as a Business User with a UEN-registered company/entity with Corppass or as a Third Party Filer for Business. Estimated processing time is 3 working days. Application is available for third party filers.\nWith effect from 14 April 2025, exporters are required to install the new Digital Document Reader (DDR) software to preview the watermarked certificates for printing.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/export-health-certificate",
  "The Free Sale Certificate (Food) allows exporters to get Singapore Food Agency endorsement for their - Meat and Fish products intended for export. - Locally processed meat and fish products intended for export - Processed food products intended for export.\nThis certificate is required for exporters of specific food products.\nEligibility Requirements: A UEN-registered company/entity with Corppass. Prerequisite Licence(s): ACRA - Registration for Companies / Business.\nEstimated processing time is 3 working days. Application is available for third party filers. Apply on GoBusiness.\nCertificate Fee: $17.11 per certificate. Payment Methods: American Express, Diners Club, JCB, Mastercard, UnionPay, Visa, PayNow, GIRO.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/free-sale-certificate-food",
  "The Free Sale Certificate for Animal Feed will be issued by the Singapore Food Agency. This certificate allows exporters to get endorsement for these animal feed products intended for export.\nThis certificate is required for exporters of animal feed products.\nEligibility Requirements: A UEN-registered company/entity with Corppass. Prerequisite Licence(s): ACRA - Registration for Companies / Business.\nApply on GoBusiness. Estimated processing time is Normal: 3 working days, Express: 1 working day. 30 minutes to complete.\nWith effect from 14 April 2025, exporters are required to install the new Digital Document Reader (DDR) software to preview the watermarked certificates for printing.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/free-sale-certificate-animal-feed-for-food-producing-animals",
  "The Veterinary Certificate will be issued by the Singapore Food Agency. This certificate allows exporters to get endorsement for certification of health and/or testing of the animals for diseases required by the destination country/region.\nThis certificate is required for exporters to certify health and testing of animals.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business.\nApply as a Business User with a UEN-registered company/entity with Corppass or as a Third Party Filer for Business.\nEstimated processing time is Normal: 3 working days, Express: 1 working day.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/veterinary-certificate-for-food-producing-animals",
  "Submission Form for Food Safety Management System for premises which are required to implement FSMS.\nThis form is required for premises that must implement a Food Safety Management System.\nFSMS Plan, valid FSMS trained certificate accepted by SFA, accredited FSMS Certificate.\nApply as an individual user with a local Singpass account or as a business user with a UEN-registered company/entity and Corppass.\nNo payment required. Estimated processing time is NA. 20 minutes to complete.\nURL: https://licensing.gobusiness.gov.sg/licence-directory/sfa/submission-form-for-food-safety-management-system",
  "The FSMS helps food businesses ensure the food they provide is safe for consumption. It is a pre-emptive approach for identifying, preventing, and reducing food-borne hazards.\nFood businesses are currently not required to submit a certified FSMS.\nCatering businesses and those providing catering as an ancillary service must implement a FSMS.\nYou can learn how to prepare and implement a FSMS plan by attending the WSQ Food Safety Course (FSC) Level 4.\nThe FSMS can be certified or non-certified.\nURL: https://www.sfa.gov.sg/regulatory-standards-frameworks-guidelines/food-safety-management/understanding-food-safety-management-system-fsms",
  "A liquor licence is required if your company/business/society intends to supply any liquor, unless otherwise exempted under the Liquor Control (Supply and Consumption) Act 2015 section 4(2).\nA liquor licence is necessary for supplying liquor to comply with legal requirements.\nThe applicant must fulfill legal requirements, and the premises must be suitable for liquor supply.\nSubmit a new liquor licence application at GoBusiness. Renewals can be done within two months prior to expiry.\nExemptions exist for certain circumstances, such as emergency deliveries or religious services.\nURL: https://www.police.gov.sg/E-Services/Apply-for-Liquor-Licence",
  "Stalls selling food items would need to obtain a Food Stall Licence from SFA, except for those under SFA exemptions.\nStalls selling food items must obtain a Food Stall Licence.\nMust complete the Food Safety Course Certificate before the Food Stall Licence can be issued.\nNEA will assist stallholders to apply for their Food Stall Licence as part of tenancy administration for NEA-managed centres/markets. If operating within centres/markets managed by NEA-appointed Operators, submit a Food Stall Licence application to SFA.\nFor application forms related to hawker stall, access them at the e-portal.\nURL: https://www.nea.gov.sg/our-services/hawker-management/becoming-a-hawker",
  "Issued to retail food establishments such as restaurants, school canteen stalls, snack bars, Halal corners, confectioneries, bakery shops, stalls within a foodcourt or its equivalent and temporary stalls in bazaars, flea market, trade fairs, etc.\nHalal certification is required for food establishments serving Halal food.\nEligibility criteria for various Halal certification schemes.\nFollow the application process outlined for Halal certification.\nDifferent categories of Halal certification schemes are available.\nURL: https://www.muis.gov.sg/halal/for-business/scheme-types---eligibility-criteria/",
  "Issued to catering establishments and central kitchen facilities.\nHalal certification is necessary for food preparation areas to ensure compliance with Halal standards.\nMust meet the criteria for food preparation areas as specified.\nApplication process for Halal certification for food preparation areas.\nCatering establishments must adhere to Halal guidelines.\nURL: https://www.muis.gov.sg/halal/for-business/scheme-types---eligibility-criteria/",
  "Issued to products which are manufactured or partly manufactured/processed in Singapore.\nHalal certification is required for products to ensure they meet Halal standards.\nProducts must comply with Halal manufacturing processes.\nFollow the application process for Halal certification for products.\nApplicable to manufacturing facilities and all products manufactured therein.\nURL: https://www.muis.gov.sg/halal/for-business/scheme-types---eligibility-criteria/",
  "Issued to poultry abattoirs for their freshly-slaughtered poultry.\nHalal certification is necessary for poultry abattoirs to ensure compliance with Halal slaughtering practices.\nMust meet Halal slaughtering standards.\nApplication process for Halal certification for poultry abattoirs.\nEnsures that poultry products are Halal certified.\nURL: https://www.muis.gov.sg/halal/for-business/scheme-types---eligibility-criteria/",
  "Issued to imported, exported or re-exported products in respect of which Halal certificates have been issued.\nHalal endorsement is required for products that are imported or exported to ensure they meet Halal standards.\nProducts must have valid Halal certificates.\nFollow the application process for Halal endorsement.\nApplicable to international trade of Halal products.\nURL: https://www.muis.gov.sg/halal/for-business/scheme-types---eligibility-criteria/",
  "Issued to stationary and mobile storage facilities such as warehouses, cold rooms and dishwashing facilities.\nHalal certification is necessary for storage facilities to ensure compliance with Halal storage practices.\nStorage facilities must meet Halal storage standards.\nApplication process for Halal certification for storage facilities.\nEnsures that Halal products are stored according to Halal guidelines.\nURL: https://www.muis.gov.sg/halal/for-business/scheme-types---eligibility-criteria/",
  "A tobacco retail licence is issued specifically to a particular outlet. If you operate more than one outlet, please make a separate application for each outlet.\nYou need a licence to retail tobacco products.\nIndividuals above MLA who have not committed the offence of selling tobacco products to minors and companies registered with ACRA or licensed by SFA to retail food and beverages.\nGo to the 24-hour GoBusiness Licensing website for easy online application. An email notification will be sent once the application is approved or rejected.\nLicences are non-transferrable between companies/outlets. Responsibilities include verifying the age of buyers and retaining invoices for transactions.\nURL: https://www.hsa.gov.sg/tobacco-regulation/licences/retail/apply"
]