[
  "Title: Import of Animal Feed for Food-Producing Animals\nSection: \nSubsection: None\nDescription: Businesses that want to import animal feed for food-producing animals (e.g. live chickens and fish) must register with SFA and obtain a Cargo Clearance Permit (CCP) issued by Singapore Customs for each consignment.",
  "URL: https://www.sfa.gov.sg/food-import-export/commercial-imports/what-you-need-to-know-for-import-of-animal-feed",
  "Title: Export / Tranship of Animal Feed for Food-Producing Animals\nSection: \nSubsection: Licence, Permit & Registration\nDescription: Businesses that want to export or tranship animal feed for food-producing animals must have a Cargo Clearance Permit (CCP) for each consignment. Animal feed for non-food-producing animals is regulated by NParks.",
  "To import, export, or tranship animal feed, you need to fulfil some general requirements. For instance, registration with ACRA is mandatory, and your UEN must be activated with Customs. In addition, if the animal feed that you intend to export/tranship is regulated by SFA, you must set up a GIRO arrangement with SFA. URL: https://www.sfa.gov.sg/commercial-exports/what-you-need-to-know-for-export-tranship-of-animal-feed",
  "Title: Licence for Import/Export/Transhipment of Meat and Fish Products\nSection: \nSubsection: None\nDescription: LICENCE FOR IMPORT/EXPORT/ TRANSSHIPMENT OF MEAT AND FISH PRODUCTS is required if Traders involved in the import/export/transshipment of meat and fish products. URL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/licence-for-import-export-transhipment-of-meat-and-fish-products",
  "Title: Licence for Import/Transhipment of Fresh Fruits and Vegetables\nSection: \nSubsection: None\nDescription: LICENSE FOR IMPORT/TRANSSHIPMENT OF FRESH FRUITS AND VEGETABLES is required if Traders involved in the import/transshipment of fresh fruits and vegetables. URL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/licence-for-import-transhipment-of-fresh-fruits-and-vegetables",
  "Title: Licence to Import Poultry\nSection: \nSubsection: None\nDescription: The Licence to Import Poultry is issued to importers by Singapore Food Agency to import Broiler Chickens and Broiler Ducks. URL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/licence-to-import-poultry",
  "Title: Licence to Import Sheep & Goats\nSection: \nSubsection: None\nDescription: The Licence to Import Sheep and Goats is issued to importers by Singapore Food Agency to import Sheep and Goats. URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Licence-to-Import-Sheep-&-Goats",
  "Title: Licence to Import Table Eggs\nSection: \nSubsection: None\nDescription: The Licence to Import Table Eggs is issued to importers by Singapore Food Agency to import Table Eggs. URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Licence-to-Import-Table-Eggs",
  "Title: Licence to Import/Export/Tranship Food Animals, Birds, Eggs and Biologics\nSection: \nSubsection: None\nDescription: The Licence to Import/Export/Transship Animals, Birds, Eggs and Biologics is issued by Singapore Food Agency. This licence is required if you intend to import/export/tranship animals, birds or their products into/out from Singapore.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/licence-to-import-export-tranship-food-animals--birds--eggs-and-biologics",
  "Title: Registration to Import Animal Feed\nSection: \nSubsection: None\nDescription: The Registration to Import Animal Feed may be issued by either Animal & Veterinary Service, a cluster of National Parks Board or Singapore Food Agency. This registration is issued to importers to import animal feed.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Registration-to-Import-Animal-Feed",
  "Title: Registration to Import Feed for Food Producing Animals\nSection: \nSubsection: None\nDescription: The Registration to Import Feed for Food Producing Animals is issued by Singapore Food Agency. This registration is issued to importers to import animal feed.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Registration-to-Import-Feed-for-Food-Producing-Animals",
  "Title: Registration to Import Processed Food Products and Food Appliances\nSection: \nSubsection: None\nDescription: Registration to Import Processed Food Products and Food Appliances is required if Traders involve in the import of processed food (not containing meat and fish products, fresh fruits and vegetables) and food appliances. URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Registration-to-Import-Processed-Food-Products-and-Food-Appliances",
  "Title: Registration to Import Live Frogs for Human Consumption\nSection: \nSubsection: None\nDescription: The Registration to Import Live Frogs for Human Consumption is issued by Singapore Food Agency. This registration is issued to importers to import live frogs intended for human consumption.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Registration-to-Import-Live-Frogs-for-Human-Consumption",
  "Title: Rice Licence\nSection: \nSubsection: None\nDescription: A licence issued by the Singapore Food Agency (SFA) is required to import (into Singapore or Singapore Free Trade Zone), export and carry out wholesale dealings in rice. URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Rice-Licence",
  "Title: Requirements for Food Shop Licences\nSection: \nSubsection: Requirements for Licence / Permit for Food Retail\nDescription: Food Shops include bakeries, restaurants, food vending machines, canteens, coffee shops, eating houses, food courts, standalone kiosks, takeaway food carts, and private canteens/markets. The requirements and conditions for Food Shop Licences can be found in the Food Shop Self-Checklist.",
  "URL: https://www.sfa.gov.sg/food-retail/licence-permit/requirements-for-licence-permit-for-food-retail",
  "Title: Requirements for Supermarket Licences\nSection: \nSubsection: Requirements for Supermarket Licences\nDescription: Supermarkets that sell raw meat or seafood, or conduct on-site preparation of food for sale require a SFA licence to operate. Retailers that solely sell pre-packed food do not require SFA food retail licences.",
  "URL: https://www.sfa.gov.sg/food-retail/licence-permit/requirements-for-supermarket-licences",
  "Title: Requirements for Temporary Fair Permits\nSection: \nSubsection: Requirements for Temporary Fair Permits\nDescription: To operate Temporary Fairs, you must have a permit from SFA. Operating without a valid permit is an offence.",
  "URL: https://www.sfa.gov.sg/food-retail/licence-permit/requirements-for-temporary-fair-permits",
  "Title: Types of Online Food Businesses\nSection: \nSubsection: None\nDescription: SFA regulates all types of food businesses in Singapore, including online food businesses. The online food business sector is diverse.",
  "The businesses can be broadly categorised into three main types: Online food sellers, Organisers of group buys, Food Delivery Services. All types of food businesses, whether online or physical, must comply with prevailing food laws and regulations. This also applies to food businesses that do not require a licence from SFA to operate, such as e-commerce platforms and organisers of group buys. URL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/online-food-businesses/types-of-online-food-businesses",
  "Title: Home-based Food Businesses\nSection: \nSubsection: About HDB/URA Home-based Business Scheme\nDescription: The Home-based Business Scheme enables anyone to run a small-scale business, including a food business, from their home, provided they comply with the requirements and conditions. This scheme allows home-based businesses to operate without requiring approval from the HDB or Urban Redevelopment Authority (URA), provided they meet all the scheme's requirements.",
  "URL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/home-based-food-businesses/about-hdb-ura-home-based-business-scheme",
  "Title: Requirements for Food Delivery Businesses\nSection: \nSubsection: None\nDescription: Food delivery businesses, although not required to obtain a licence from the SFA to operate, still have legal responsibilities and must comply with food safety laws and regulations. URL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/food-delivery-businesses/requirements-for-food-delivery-businesses",
  "Title: Guidelines for Group-Buy Organisers\nSection: \nSubsection: None\nDescription: Group buying is a type of online food business where an organiser buys food in bulk for group members to get lower prices or other perks. Even though you do not need a licence to organise a group buy, you must still comply with the law.",
  "Here is how you can fulfil your legal responsibilities when organising group buys. URL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/group-buy-activities/guidelines-for-group-buy-organisers",
  "Title: Food Shop Licence\nSection: \nSubsection: None\nDescription: For the operation of a food shop where there is retail sale of food and/or beverage. You will need to apply for a Food Shop Licence if you intend to operate a retail food outlet where food and/or drink are sold wholly by retail.",
  "The purpose of licensing is to ensure cleanliness and food safety in food retail outlets and to prevent food-borne diseases. URL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/food-shop-licence",
  "Title: Food Stall Licence\nSection: \nSubsection: None\nDescription: For the operation of a foodstall where there is retail sale of food and/or beverage in a foodshop such as private eating houses, coffeeshops, food courts, canteens and private markets. URL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/food-stall-licence",
  "Title: Supermarket Licence\nSection: \nSubsection: None\nDescription: For the operation of a supermarket with the sale/preparation of raw food. You will need to apply for a Supermarket Licence if you intend to operate a supermarket with the sale/preparation of raw food. The purpose of licensing is to ensure cleanliness and food safety in supermarkets and to prevent food-borne diseases.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Supermarket-Licence",
  "Title: Permit for Temporary Fair\nSection: \nSubsection: None\nDescription: A temporary set up with makeshift stalls to sell food and or goods. A permit is required from SFA to hold a fair.",
  "The permit will be issued to the operator who manages and operates the fair only after all requirements have been complied with. No fair shall begin operation, unless a permit is issued. The permit is $60, regardless of the duration of the temporary fair. URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Permit-for-Temporary-Fair",
  "Title: Temporary Fair Stall Licence\nSection: \nSubsection: None\nDescription: This licence is only for stalls within temporary fairs that conduct handling or preparation of food for sale. There is no separate fee for this licence, and it is valid only during the fair duration.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Temporary-Fair-Stall-Licence",
  "Title: Businesses that Need Licence / Registration for Food Manufacturing & Storage\nSection: \nSubsection: Licence & Registration\nDescription: To carry out any food manufacturing or food storage activities in your establishment, you must have a licence/registration from SFA. It is an offence under the prevailing food safety laws to carry out the above activities without a valid SFA licence/registration.",
  "URL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "Title: Licence to Operate a Coldstore\nSection: \nSubsection: Licence & Registration\nDescription: All coldstores for meat and seafood products must be licensed before they store food for wholesale distribution. This licence is for storage only.",
  "There must not be any processing or retail activities. URL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "Title: Licence to Operate a Slaughterhouse\nSection: \nSubsection: Licence & Registration\nDescription: All slaughterhouses for poultry and livestock must be licensed before they slaughter, process, prepare, package, or store food for distribution to wholesalers or retailers. URL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "Title: Registration of Food Storage Warehouses (non-meat/non-fish)\nSection: \nSubsection: Licence & Registration\nDescription: Food storage warehouses are encouraged to register with SFA to facilitate traceability in the event of food recalls. URL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "Title: Application Process & Fees for Licence to Manufacture and Process Animal Feed for Food-Producing Animals\nSection: \nSubsection: Licence, Permit & Registration\nDescription: You must have a SFA licence to manufacture or process animal feed for food-producing animals. This page outlines the main steps involved in the application for a licence.",
  "All local producers of animal feed for food-producing animals must be licensed by SFA before commencing feed production at the approved establishment. The licence is issued with a validity period of 1 year. URL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/application-process-fees-for-licence-to-manufacture-and-process-animal-feed",
  "Title: Licence to Manufacture Animal Feed and Process of Animal Feed for Food Producing Animals\nSection: \nSubsection: None\nDescription: All local commercial producers of animal feed for food producing animals must get a Singapore Food Agency (SFA)’s issued licence before they can manufacture and process animal feed. This include livestock feed and aquaculture feed.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Licence-to-Manufacture-Animal-Feed-and-Process-of-Animal-Feed-for-Food-Producing-Animals",
  "Title: Businesses that Need Licence / Registration for Farming\nSection: \nSubsection: Licence, Permit & Registration\nDescription: To carry out farming activities regulated by SFA, you must have the required licence/registration. You will need a licence/registration for the following activities regulated by SFA: operating a land-based farm for commercial production, operating a fish culture farm for commercial production, operating fishing vessels servicing fish culture farms, engaging personnel for activities on fish culture farms.",
  "URL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-farming",
  "Title: Fish Culture Farm Licence\nSection: \nSubsection: Licence, Permit & Registration\nDescription: Sea-based fish culture farms for commercial production e.g. fish farms and shrimp farms.",
  "URL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-farming",
  "Title: Fishing Vessel Licence\nSection: \nSubsection: Licence, Permit & Registration\nDescription: Servicing fish culture farms. URL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-farming",
  "Title: Registration of Personnel on Fish Culture Farms\nSection: \nSubsection: Licence, Permit & Registration\nDescription: All employees and persons engaged in activities on the fish culture farm. URL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-farming",
  "Title: Requirements for Pesticide Usage in Farms\nSection: \nSubsection: Pesticides\nDescription: Licensed farms are only permitted to use agricultural pesticides that are registered with SFA. Registered pesticides can only be applied by certified pesticide operators.",
  "URL: https://www.sfa.gov.sg/farming/pesticides/requirements-for-pesticide-usage-in-farms",
  "Title: Businesses that Need Licence / Registration for Fishing Vessel, Gear & Personnel\nSection: \nSubsection: None\nDescription: All inboard fishing vessels and fishing equipment onboard must be licensed by SFA. Individuals employed or engaged in any activity on a fishing vessel must also be registered.",
  "Operating a fishing vessel without a licence is an offence. URL: https://www.sfa.gov.sg/wholesale-markets-fishery-ports/licence-registration/businesses-that-need-licence-registration-for-fishing-vessel-gear-personnel",
  "Title: Health Certificate for Export of Live Foodfish for Breeding\nSection: \nSubsection: None\nDescription: The Health Certificate for Export of Live Foodfish is issued by Singapore Food Agency that allows exporters to export live food fish for farming. With effect from 14 April 2025, exporters are required to install the new Digital Document Reader (DDR) software to preview the watermarked certificates for printing.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/health-certificate-for-export-of-live-foodfish-for-breeding",
  "Title: Export Health Certificate\nSection: \nSubsection: None\nDescription: The Export Health Certificate is issued to traders, to certify a food consignment as fit for human consumption, and meeting safety standards or other required criteria to facilitate the export of this food consignment. This certificate is only issued for food consignments manufactured or processed or packed in a food processing establishment licensed by Singapore Food Agency.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/export-health-certificate",
  "Title: Free Sale Certificate (Food)\nSection: \nSubsection: None\nDescription: The Free Sale Certificate (Food) allows exporters to get Singapore Food Agency endorsement for their - Meat and Fish products intended for export. - Locally processed meat and fish products intended for export - Processed food products intended for export.",
  "With effect from 14 April 2025, exporters are required to install the new Digital Document Reader (DDR) software to preview the watermarked certificates for printing. URL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/free-sale-certificate-(food)",
  "Title: Free Sale Certificate (Animal Feed) for Food Producing Animals\nSection: \nSubsection: None\nDescription: The Free Sale Certificate for Animal Feed will be issued by the Singapore Food Agency. This certificate allows exporters to get endorsement for these animal feed products intended for export.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Free-Sale-Certificate-(Animal-Feed)-for-Food-Producing-Animals",
  "Title: Veterinary Certificate for Food Producing Animals\nSection: \nSubsection: None\nDescription: The Veterinary Certificate will be issued by the Singapore Food Agency. This certificate allows exporters to get endorsement for certification of health and/or testing of the animals for diseases required by the destination country/region.",
  "URL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Veterinary-Certificate-for-Food-Producing-Animals",
  "Title: Submission Form for Food Safety Management System\nSection: \nSubsection: None\nDescription: Submission Form for Food Safety Management System\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Submission-Form-for-Food-Safety-Management-System",
  "Title: Understanding the Food Safety Management System (FSMS)\nSection: \nSubsection: None\nDescription: The FSMS helps food businesses ensure the food they provide is safe for consumption. It is a pre-emptive approach for identifying, preventing, and reducing food-borne hazards.",
  "URL: https://www.sfa.gov.sg/regulatory-standards-frameworks-guidelines/food-safety-management/understanding-food-safety-management-system-fsms",
  "Title: Apply for Liquor Licence\nSection: \nSubsection: None\nDescription: A liquor licence is required if your company/business/society intends to supply any liquor, unless otherwise exempted under the Liquor Control (Supply and Consumption) Act 2015 section 4(2). URL: https://www.police.gov.sg/E-Services/Apply-for-Liquor-Licence",
  "Title: Goods Vehicle and Engineering Plant Registration\nSection: \nSubsection: None\nDescription: All vehicles in Singapore, including goods vehicles and engineering plants, must be registered before they can be used or driven on public roads. However, not all registered engineering plants are allowed on public roads.",
  "URL: https://onemotoring.lta.gov.sg/content/onemotoring/home/buying/vehicle-types-and-registrations/commercial-vehicle/goods-vehicle-and-engineering-plant.html",
  "Title: Becoming a Hawker\nSection: \nSubsection: None\nDescription: Everything you need to know about the regulatory requirements of hawker business. NEA will assist stallholders to apply for their Food Stall Licence as part of tenancy administration.",
  "However, if you are a stallholder operating within centres/markets that have the tenancies managed by NEA-appointed Operators, you will need to submit a Food Stall Licence application to SFA. URL: https://www.nea.gov.sg/our-services/hawker-management/becoming-a-hawker",
  "Title: Tobacco Retail Licence\nSection: \nSubsection: None\nDescription: A tobacco retail licence is issued specifically to a particular outlet. If you operate more than one outlet, please make a separate application for each outlet.",
  "You are allowed to start retail sales when your licence application is approved. Licences are non-transferrable between companies / outlets. URL: https://www.hsa.gov.sg/tobacco-regulation/licences/retail/apply"
]