[
  "Businesses that want to import animal feed for food-producing animals (e.g. live chickens and fish) must register with SFA and obtain a Cargo Clearance Permit (CCP) issued by Singapore Customs for each consignment.\nBusinesses must register to import animal feed for food-producing animals.\nMust be registered with ACRA, activate UEN with Singapore Customs, set up a GIRO arrangement with SFA, and ensure animal feed complies with SFA’s requirements.\nLog into the GoBusiness portal to submit your Registration to Import Animal Feed. Complete applications are processed within 1 working day.\nAnimal feed must be packaged and labelled in English with specific information.\nURL: https://www.sfa.gov.sg/food-import-export/commercial-imports/what-you-need-to-know-for-import-of-animal-feed",
  "Businesses that want to export or tranship animal feed for food-producing animals must have a Cargo Clearance Permit (CCP) for each consignment. Animal feed for non-food-producing animals is regulated by NParks. To import, export, or tranship animal feed, you need to fulfil some general requirements. For instance, registration with ACRA is mandatory, and your UEN must be activated with Customs. In addition, if the animal feed that you intend to export/tranship is regulated by SFA, you must set up a GIRO arrangement with SFA.\nAnimal feed that is manufactured or processed locally must be manufactured or processed by a SFA-approved establishment holding a valid Licence.\nAnimal feed must be manufactured or processed by a SFA-approved establishment holding a valid Licence to Manufacture and Process Animal Feed from SFA. Registration with ACRA is mandatory, and UEN must be activated with Customs. A GIRO arrangement with SFA is required if the animal feed is regulated by SFA.\nStep 1: Ensure that your animal feed meets SFA’s requirements. Step 2: Ensure that your animal feed meets the requirements of the destination country/region. Step 3: Apply for a Cargo Clearance Permit (CCP) through TradeNet for each consignment.\nApproval by SFA is processed within 1 working day. Fees for animal feed are $22 per consignment.\nURL: https://www.sfa.gov.sg/commercial-exports/what-you-need-to-know-for-export-tranship-of-animal-feed",
  "LICENCE FOR IMPORT/EXPORT/ TRANSSHIPMENT OF MEAT AND FISH PRODUCTS is required if Traders involved in the import/export/transshipment of meat and fish products.\nRequired for traders involved in the import/export/transshipment of meat and fish products.\n1. Top Up CPF MediSave. 2. Activate UEN with Singapore Customs. 3. Submit original GIRO form.\nApply on GoBusiness Dashboard. Refer to the user guide for application steps.\nLicence Fee: $84.00. Documents Needed: Any Supporting Documents (max upload per application: 2MB).\nURL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/licence-for-import-export-transhipment-of-meat-and-fish-products",
  "LICENSE FOR IMPORT/TRANSSHIPMENT OF FRESH FRUITS AND VEGETABLES is required if Traders involved in the import/transshipment of fresh fruits and vegetables.\nRequired for traders involved in the import/transshipment of fresh fruits and vegetables.\n1. Top Up CPF MediSave. 2. Activate UEN with Singapore Customs. 3. Submit original GIRO form.\nApply on GoBusiness Dashboard. Refer to the guide on the steps for application.\nLicence Fee: $378.00. Any supporting document required, maximum upload per application: 2MB.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/licence-for-import-transhipment-of-fresh-fruits-and-vegetables",
  "The Licence to Import Poultry is issued to importers by Singapore Food Agency to import Broiler Chickens and Broiler Ducks.\nThis licence is required for businesses importing poultry.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business\nApply on GoBusiness Dashboard. Refer to the new application user guide and common modules user guide for assistance.\nThis licence is only for business users with a registered Unique Entity Number (UEN).\nURL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/licence-to-import-poultry",
  "The Licence to Import Sheep and Goats is issued to importers by Singapore Food Agency to import Sheep and Goats.\nThis licence is required for importers to import sheep and goats.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business\nApply on GoBusiness Dashboard. Refer to the new application user guide and common modules user guide for assistance.\nThis licence is only for business users with a registered Unique Entity Number (UEN).\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Licence-to-Import-Sheep-&-Goats",
  "The Licence to Import Table Eggs is issued to importers by Singapore Food Agency to import Table Eggs.\nThis licence is required for importers to import Table Eggs.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business, SFA - Licence to Operate a Food Processing Establishment.\nApply on GoBusiness Dashboard.\nFor Business Users only. This licence is only for business users with a registered Unique Entity Number (UEN).\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Licence-to-Import-Table-Eggs",
  "The Licence to Import/Export/Transship Animals, Birds, Eggs and Biologics is issued by Singapore Food Agency. This licence is required if you intend to import/export/tranship animals, birds or their products into/out from Singapore.\nThis licence is required for importing/exporting/transhipping animals, birds, or their products.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business\nApply on GoBusiness Dashboard. Refer to the new application user guide and common modules user guide for assistance.\nFees: Commercial (Birds / Eggs): $62, Animal Product / Reproduction Material: $22, Commercial (Livestock): $87.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/licence-to-import-export-tranship-food-animals--birds--eggs-and-biologics",
  "The Registration to Import Animal Feed may be issued by either Animal & Veterinary Service, a cluster of National Parks Board or Singapore Food Agency. This registration is issued to importers to import animal feed.\nThis registration is required for importers to import animal feed.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business\nApply on GoBusiness Licensing. Please use desktop / laptop to apply for this licence. You can only view application details and make payment via mobile.\nThis licence is only for business users with a registered Unique Entity Number (UEN).\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Registration-to-Import-Animal-Feed",
  "The Registration to Import Feed for Food Producing Animals is issued by Singapore Food Agency. This registration is issued to importers to import animal feed.\nThis registration is required for importers to import animal feed for food-producing animals.\nThis licence is only for business users with a registered Unique Entity Number (UEN).\nApply on GoBusiness Dashboard.\nN.A.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Registration-to-Import-Feed-for-Food-Producing-Animals",
  "Registration to Import Processed Food Products and Food Appliances is required if Traders involve in the import of processed food (not containing meat and fish products, fresh fruits and vegetables) and food appliances.\nThis licence is required for traders importing processed food and food appliances.\n1. Top Up CPF MediSave. 2. Activate UEN with Singapore Customs. 3. Submit original GIRO form.\nApply on GoBusiness Dashboard.\nThis licence is only for business users with a registered Unique Entity Number (UEN).\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Registration-to-Import-Processed-Food-Products-and-Food-Appliances",
  "The Registration to Import Live Frogs for Human Consumption is issued by Singapore Food Agency. This registration is issued to importers to import live frogs intended for human consumption.\nThis registration is required for importers to import live frogs intended for human consumption.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business\nApply on GoBusiness Dashboard. Refer to the guide on the steps for application.\nThis licence is only for business users with a registered Unique Entity Number (UEN).\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Registration-to-Import-Live-Frogs-for-Human-Consumption",
  "A licence issued by the Singapore Food Agency (SFA) is required to import (into Singapore or Singapore Free Trade Zone), export and carry out wholesale dealings in rice.\nRice is a controlled item under the Price Control Act and requires a licence for import, export, and wholesale dealings.\nThis licence is only for business users with a registered Unique Entity Number (UEN).\nApply on GoBusiness Dashboard.\nFor more information on permit applications for import and export, rice licences, and FAQs, please visit the Rice website.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Rice-Licence",
  "Food Shops include bakeries, restaurants, food vending machines, canteens, coffee shops, eating houses, food courts, standalone kiosks, takeaway food carts, and private canteens/markets. The requirements and conditions for Food Shop Licences can be found in the Food Shop Self-Checklist.\nFood Shops must have a Food Shop Licence to operate.\nOperators must provide hand sanitisers or disposable gloves in buffet settings, and selected food shops must implement the Environmental Sanitation Regime (ESR).\nRefer to the Food Shop Self-Checklist for detailed requirements.\nSpecific types of Food Shops, such as Pet Cafes, Mobile Food Wagons, and Mini Restaurants have additional requirements.\nURL: https://www.sfa.gov.sg/food-retail/licence-permit/requirements-for-licence-permit-for-food-retail",
  "Supermarkets that sell raw meat or seafood, or conduct on-site preparation of food for sale require a SFA licence to operate. Retailers that solely sell pre-packed food do not require SFA food retail licences.\nSupermarkets selling raw meat or seafood or conducting on-site preparation must have a licence.\nDocumentary, design, and other requirements as detailed in the Supermarket Self-Checklist.\nContact SFA via the Online Feedback Form for more information.\nBeverage Container Return Scheme will be introduced from 1 April 2026.\nURL: https://www.sfa.gov.sg/food-retail/licence-permit/requirements-for-supermarket-licences",
  "To operate Temporary Fairs, you must have a permit from SFA. Operating without a valid permit is an offence.\nTemporary Fairs require a permit to operate legally.\nPermit holders must ensure all stalls handling food hold SFA licences and comply with SFA’s requirements.\nSubmit your application at least 2 weeks before the fair start date.\nOperators must comply with Environmental Public Health (Food Hygiene) Regulations.\nURL: https://www.sfa.gov.sg/food-retail/licence-permit/requirements-for-temporary-fair-permits",
  "SFA regulates all types of food businesses in Singapore, including online food businesses. The online food business sector is diverse. The businesses can be broadly categorised into three main types: Online food sellers, Organisers of group buys, Food Delivery Services. All types of food businesses, whether online or physical, must comply with prevailing food laws and regulations. This also applies to food businesses that do not require a licence from SFA to operate, such as e-commerce platforms and organisers of group buys.\nE-commerce platforms and organisers of group buys do not require a licence to operate.\nMust comply with prevailing food laws and regulations.\nN/A\nThe sale of food that is unsafe, unsuitable, or unfit for consumption is prohibited.\nURL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/online-food-businesses/types-of-online-food-businesses",
  "The Home-based Business Scheme enables anyone to run a small-scale business, including a food business, from their home, provided they comply with the requirements and conditions. This scheme allows home-based businesses to operate without requiring approval from the HDB or Urban Redevelopment Authority (URA), provided they meet all the scheme's requirements.\nHome-based food businesses do not require approval from the HDB or URA to operate.\nAll home-based food businesses must comply with food rules and regulations and food safety laws.\nFor more details, see: Requirements for Home-based Food Businesses.\nSpecific restrictions apply, such as not selling to food retailers and not offering ready-to-eat raw seafood.\nURL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/home-based-food-businesses/about-hdb-ura-home-based-business-scheme",
  "Food delivery businesses, although not required to obtain a licence from the SFA to operate, still have legal responsibilities and must comply with food safety laws and regulations.\nFood delivery businesses are not required to obtain a licence from the SFA to operate.\nOperators must ensure that the way in which food is delivered to customers does not compromise food safety.\nN/A\nFood delivery workers are not required to attend food safety courses as they do not handle or prepare food.\nURL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/food-delivery-businesses/requirements-for-food-delivery-businesses",
  "Group buying is a type of online food business where an organiser buys food in bulk for group members to get lower prices or other perks. Even though you do not need a licence to organise a group buy, you must still comply with the law. Here is how you can fulfil your legal responsibilities when organising group buys.\nGroup buys are private arrangements among members of a group and do not require a licence from SFA.\nFollow food safety laws to ensure food is safe for everyone.\nNo application process required for organising group buys.\nEducate group members about food safety practices.\nURL: https://www.sfa.gov.sg/food-retail/businesses-that-currently-do-not-need-licence-permit/group-buy-activities/guidelines-for-group-buy-organisers",
  "For the operation of a food shop where there is retail sale of food and/or beverage. You will need to apply for a Food Shop Licence if you intend to operate a retail food outlet where food and/or drink are sold wholly by retail. The purpose of licensing is to ensure cleanliness and food safety in food retail outlets and to prevent food-borne diseases.\nLicensing is required to ensure cleanliness and food safety in food retail outlets.\nComplete all fields on the application form, submit layout plan with metric scale, indicate kitchen equipment and infrastructure, and boundaries of refreshment area.\nStep 1: Obtain In-Principle Approval via GoBusiness. Step 2: Commence Renovation & Set-up. Step 3: Request for Inspection. Step 4: Complete Payment for Licence.\nThe licence costs $195.00 and is valid for one year. Selected retail foodshops are required to implement the mandatory ES regime and submit the Environmental Sanitation Programme (ESP) within 1 month to NEA.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/food-shop-licence",
  "For the operation of a foodstall where there is retail sale of food and/or beverage in a foodshop such as private eating houses, coffeeshops, food courts, canteens and private markets.\nRequired for operating a food stall in designated areas.\nComplete all fields on the application form Submit the tenancy / lease agreement along with its Certificate of Stamp Duty Submit the layout plan that reflects the location of the specific stall\nApply on GoBusiness Dashboard. Successful applicants will be notified within 7 working days via email.\nThe Food Stall Licence costs S$32.00 and is valid for one year, with options for two-year validity.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/food-stall-licence",
  "For the operation of a supermarket with the sale/preparation of raw food. You will need to apply for a Supermarket Licence if you intend to operate a supermarket with the sale/preparation of raw food. The purpose of licensing is to ensure cleanliness and food safety in supermarkets and to prevent food-borne diseases.\nTo ensure cleanliness and food safety in supermarkets and to prevent food-borne diseases.\nPlanning Permission/Change of Use approval, Approval from URA/HDB for the use of the premises, Layout plan of the premises, Tenancy Agreement/Letter of consent, Pest Control Contract, Cleaning programme/schedule, Food Safety Course Level 1 certificate.\nStep 1: Obtain In-Principle Approval via GoBusiness. Step 2: Commence Renovation & Set-up. Step 3: Request for Inspection. Step 4: Complete Payment for Licence.\nThe supermarket licence costs $250.00/$500.00 depending on the total floor area and is valid for one year.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Supermarket-Licence",
  "A temporary set up with makeshift stalls to sell food and or goods. A permit is required from SFA to hold a fair. The permit will be issued to the operator who manages and operates the fair only after all requirements have been complied with. No fair shall begin operation, unless a permit is issued. The permit is $60, regardless of the duration of the temporary fair.\nUnder the Environmental Public Health Act, all operators of temporary fairs must get a permit from SFA for the duration of the fair.\nLetter of appointment Site use approval Support documentation (e.g. consensus from shopkeepers’/merchants’ association) Layout plan detailing stalls with food handling and their necessary infrastructure Completed declaration form\nSubmit complete application via GoBusiness at least 2 weeks before the fair commencement date. Documentation must be submitted at least five working days before the planned fair start date.\nOperating temporary fairs illegally without a valid permit is an offence. Prohibitions include the display and/or sale of animals and tobacco products.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Permit-for-Temporary-Fair",
  "This licence is only for stalls within temporary fairs that conduct handling or preparation of food for sale. There is no separate fee for this licence, and it is valid only during the fair duration.\nThis licence is required for stalls that handle or prepare food for sale at temporary fairs.\nA photocopy of food handler’s WP (both sides) Food Safety Course Level 1 / Refresher Food Safety Course Level 1 A copy of lease contract with temporary fair organiser / appointed temporary fair operator\nApply on GoBusiness Dashboard.\nNo licence is needed for stalls that sell non-food items or pre-packed food items from SFA-licensed food processing establishments, food retail establishments, or importers.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Temporary-Fair-Stall-Licence",
  "To carry out any food manufacturing or food storage activities in your establishment, you must have a licence/registration from SFA. It is an offence under the prevailing food safety laws to carry out the above activities without a valid SFA licence/registration.\nAll food processing establishments must be licensed before they manufacture, process, prepare, or package food for distribution to wholesalers and retailers.\nApplicants must comply with general requirements, prevailing food safety laws, and licensing conditions.\nFor details on the application process, see Application Process & Fees for Licence / Registration for Food Manufacturing & Storage.\nFood processing establishments are not permitted to manufacture or store feed for non-food producing animals.\nURL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "All coldstores for meat and seafood products must be licensed before they store food for wholesale distribution. This licence is for storage only. There must not be any processing or retail activities.\nAll coldstores for meat and seafood products must be licensed before they store food for wholesale distribution.\nApplicants must comply with general requirements, prevailing food safety laws, and licensing conditions.\nFor details on the application process, see Application Process & Fees for Licence / Registration for Food Manufacturing & Storage.\nIf you process and store meat and seafood products, you only need to apply for the Licence to Operate a Food Processing Establishment.\nURL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "All slaughterhouses for poultry and livestock must be licensed before they slaughter, process, prepare, package, or store food for distribution to wholesalers or retailers.\nAll slaughterhouses for poultry and livestock must be licensed before they slaughter, process, prepare, package, or store food for distribution.\nApplicants must comply with general requirements, prevailing food safety laws, and licensing conditions.\nFor details on the application process, see Application Process & Fees for Licence / Registration for Food Manufacturing & Storage.\nFood processing establishments are not permitted to manufacture or store feed for non-food producing animals.\nURL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "Food storage warehouses are encouraged to register with SFA to facilitate traceability in the event of food recalls.\nFood storage warehouses are encouraged to register with SFA to facilitate traceability in the event of food recalls.\nApplicants must be eligible and are advised to align their practices to SFA’s Good Warehousing Practices.\nFor details on the application process, see Application Process & Fees for Licence / Registration for Food Manufacturing & Storage.\nYou will require a SFA licence if there is chilled/frozen storage of meat and seafood products.\nURL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/businesses-that-need-licence-registration-for-food-manufacturing-storage",
  "You must have a SFA licence to manufacture or process animal feed for food-producing animals. This page outlines the main steps involved in the application for a licence. All local producers of animal feed for food-producing animals must be licensed by SFA before commencing feed production at the approved establishment. The licence is issued with a validity period of 1 year.\nAll local producers of animal feed for food-producing animals must be licensed by SFA before commencing feed production.\nMust be registered with ACRA and have a UEN issued by ACRA. Applicants must have an active CorpPass account.\nStep 1: Submit licence application and business proposal via GoBusiness portal. Step 2: Apply for pre-licensing inspection. Step 3: Sign up for GIRO for payment. Step 4: SFA issues your licence. Step 5: Pay licence fees via GoBusiness portal.\nFeed producers are not permitted to supply animal feed to consumers or to food establishments for processing or retail as human food.\nURL: https://www.sfa.gov.sg/food-manufacturing-storage/licence-registration/application-process-fees-for-licence-to-manufacture-and-process-animal-feed",
  "All local commercial producers of animal feed for food producing animals must get a Singapore Food Agency (SFA)’s issued licence before they can manufacture and process animal feed. This include livestock feed and aquaculture feed.\nThis licence is required for local commercial producers of animal feed for food producing animals.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business. Approval document for use of Premises and waste disposal (URA, HDB / JTC, NEA / SFA), Layout plan of production area, Flow Chart of manufacturing/processing steps, Labelling, Standard Operation Procedure.\nApply on GoBusiness Dashboard.\nLicence Fees: $240.00.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Licence-to-Manufacture-Animal-Feed-and-Process-of-Animal-Feed-for-Food-Producing-Animals",
  "To carry out farming activities regulated by SFA, you must have the required licence/registration. You will need a licence/registration for the following activities regulated by SFA: operating a land-based farm for commercial production, operating a fish culture farm for commercial production, operating fishing vessels servicing fish culture farms, engaging personnel for activities on fish culture farms.\nRequired for operating land-based farms for commercial food production.\nLand-based farms for keeping, rearing, or breeding animals or birds, or cultivating plants, for commercial food production.\nFor details on how to apply, see Application Process & Fees for Licence for Farming.\nFees for Farm Licence is $100 per year.\nURL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-farming",
  "Sea-based fish culture farms for commercial production e.g. fish farms and shrimp farms.\nRequired for operating sea-based fish culture farms for commercial production.\nSea-based fish culture farms for commercial production.\nFor details on how to apply, see Application Process & Fees for Licence for Farming.\nFees for Fish Culture Farm Licence is $145 per year.\nURL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-farming",
  "Servicing fish culture farms.\nRequired for servicing fish culture farms.\nFishing vessels servicing fish culture farms.\nFor details on how to apply, see Application Process & Fees for Licence for Farming.\nFees for Fishing Vessel Licence range from $66 to $470 per year depending on the vessel type.\nURL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-farming",
  "All employees and persons engaged in activities on the fish culture farm.\nNo fee is required for registration of personnel.\nAll employees and persons engaged in activities on the fish culture farm.\nFor details on how to apply, see Application Process & Fees for Licence for Farming.\nRegistration of Personnel has no fee.\nURL: https://www.sfa.gov.sg/farming/licence-registration/businesses-that-need-licence-registration-for-farming",
  "Licensed farms are only permitted to use agricultural pesticides that are registered with SFA. Registered pesticides can only be applied by certified pesticide operators.\nAll farm licensees are required to comply with the usage requirements.\nUse only registered agricultural pesticides Never use or store non-agricultural pesticides on your farm Pesticides must be applied by certified pesticide operators Always ensure pesticide residue is within limits Keep records of pesticide use Dispose of unused pesticides and empty pesticide receptacles safely The requirements apply also to pesticide-free or chemical-free farms\nFarm licensees can contact their Account Manager. You can also contact via the SFA Online Feedback Form.\nSFA ensures compliance through the surveillance regime and will take action against any infringements.\nURL: https://www.sfa.gov.sg/farming/pesticides/requirements-for-pesticide-usage-in-farms",
  "All inboard fishing vessels and fishing equipment onboard must be licensed by SFA. Individuals employed or engaged in any activity on a fishing vessel must also be registered. Operating a fishing vessel without a licence is an offence.\nAll inboard fishing vessels need to be licensed.\nTo obtain the required licences/registrations, you must meet certain conditions.\nFor details on how to apply, see Application Process & Fees for Licence / Registration of Fishing Vessel, Fishing Gear, Persons Engaged or Employed on Fishing Vessel, Entry Permit and Port Clearance/Report of Arrival at SFA Fishery Ports.\nFees for licences vary based on the type of vessel and gear.\nURL: https://www.sfa.gov.sg/wholesale-markets-fishery-ports/licence-registration/businesses-that-need-licence-registration-for-fishing-vessel-gear-personnel",
  "The Health Certificate for Export of Live Foodfish is issued by Singapore Food Agency that allows exporters to export live food fish for farming. With effect from 14 April 2025, exporters are required to install the new Digital Document Reader (DDR) software to preview the watermarked certificates for printing.\nThis licence is required for exporters to export live food fish for farming.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business\nApply on GoBusiness Dashboard. For more details on the installation of the DDR software, refer to the Digital Document Reader Guide. You may refer to the guide on how to fill up the application form on the GoBusiness portal.\nCertificate Fee: $16.80, Express Fee: $33.60. Pre-export inspection charges may also apply.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/health-certificate-for-export-of-live-foodfish-for-breeding",
  "The Export Health Certificate is issued to traders, to certify a food consignment as fit for human consumption, and meeting safety standards or other required criteria to facilitate the export of this food consignment. This certificate is only issued for food consignments manufactured or processed or packed in a food processing establishment licensed by Singapore Food Agency.\nThis certificate is required to certify food consignments for export.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business.\nApply on GoBusiness Dashboard. You may refer below for the guide on more details on the installation of the DDR software. FAQs available for application form guidance.\nCertificate Fee: $20.00. Maximum upload per application: 2MB for various document types.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/export-health-certificate",
  "The Free Sale Certificate (Food) allows exporters to get Singapore Food Agency endorsement for their - Meat and Fish products intended for export. - Locally processed meat and fish products intended for export - Processed food products intended for export. With effect from 14 April 2025, exporters are required to install the new Digital Document Reader (DDR) software to preview the watermarked certificates for printing.\nThis licence is required for exporters to obtain endorsement for food products intended for export.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business.\nApply on GoBusiness Dashboard. You may refer to the guide on the steps for application.\nCertificate Fee: $17.11 per certificate. Maximum upload per application: 2MB.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/singapore-food-agency-(sfa)/free-sale-certificate-(food)",
  "The Free Sale Certificate for Animal Feed will be issued by the Singapore Food Agency. This certificate allows exporters to get endorsement for these animal feed products intended for export.\nThis certificate is required for exporters of animal feed products.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business.\nApply on GoBusiness Dashboard. Ensure timely implementation to avoid disruptions to your export operations.\nCertificate Fee: $21.40; Express Fee: $42.80. Maximum upload per application: 2MB for most documents, 5MB for Certificate of Analysis.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Free-Sale-Certificate-(Animal-Feed)-for-Food-Producing-Animals",
  "The Veterinary Certificate will be issued by the Singapore Food Agency. This certificate allows exporters to get endorsement for certification of health and/or testing of the animals for diseases required by the destination country/region.\nThis certificate is required for exporters to certify the health of food-producing animals.\nPrerequisite Licence(s): ACRA - Registration for Companies / Business.\nApply on GoBusiness Dashboard. For more information, refer to the New application user guide and Common modules user guide.\nCertificate Fee: $23.00; Express Fee: $46.00. Maximum upload per application: 2MB. Various document formats accepted.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Veterinary-Certificate-for-Food-Producing-Animals",
  "Submission Form for Food Safety Management System\nThis is a required submission for compliance with food safety management.\nN.A.\nApply on GoBusiness Dashboard\nGoBusiness is a Whole-of-Government initiative for businesses in Singapore to access Government e-services and resources.\nURL: https://www.gobusiness.gov.sg/browse-all-licences/Singapore-Food-Agency-(SFA)/Submission-Form-for-Food-Safety-Management-System",
  "The FSMS helps food businesses ensure the food they provide is safe for consumption. It is a pre-emptive approach for identifying, preventing, and reducing food-borne hazards.\nFood businesses are currently not required to submit a certified FSMS.\nCatering businesses and those providing catering as an ancillary service must implement a FSMS.\nYou can learn how to prepare and implement a FSMS plan by attending the WSQ Food Safety Course (FSC) Level 4.\nThe FSMS can be certified or non-certified.\nURL: https://www.sfa.gov.sg/regulatory-standards-frameworks-guidelines/food-safety-management/understanding-food-safety-management-system-fsms",
  "A liquor licence is required if your company/business/society intends to supply any liquor, unless otherwise exempted under the Liquor Control (Supply and Consumption) Act 2015 section 4(2).\nA liquor licence is required for supplying liquor.\nThe applicant must fulfill the legal requirements to be granted a liquor licence. The premises must be suitable for the supply of liquor.\n['Submit a new liquor licence application via GoBusiness.', 'Renewal can be done within two months prior to expiry.', 'Amendments to the licence can be made for company name, premises, key appointment holders, etc.']\nFailure to obtain a liquor licence can result in fines up to $20,000.\nURL: https://www.police.gov.sg/E-Services/Apply-for-Liquor-Licence",
  "All vehicles in Singapore, including goods vehicles and engineering plants, must be registered before they can be used or driven on public roads. However, not all registered engineering plants are allowed on public roads.\nAll goods vehicles and engineering plants in Singapore must be registered with LTA before they can be used or driven on public roads.\nThere are 4 types of goods vehicles: Light Goods Vehicles, Heavy Goods Vehicles, Very Heavy Goods Vehicles, Goods-cum-Passengers Vehicles. Lifespan for goods vehicles is 20 years.\n1. Through a Motor Dealer or 2. Self-registration at LTA Customer Service Centre. Steps include applying for a Vehicle Approval Code (VAC), submitting documents, paying fees, affixing registration number plates, and displaying side markings for Light Goods Vehicles.\nRegistered engineering plants have no lifespan restriction.\nURL: https://onemotoring.lta.gov.sg/content/onemotoring/home/buying/vehicle-types-and-registrations/commercial-vehicle/goods-vehicle-and-engineering-plant.html",
  "Everything you need to know about the regulatory requirements of hawker business. NEA will assist stallholders to apply for their Food Stall Licence as part of tenancy administration. However, if you are a stallholder operating within centres/markets that have the tenancies managed by NEA-appointed Operators, you will need to submit a Food Stall Licence application to SFA.\nStalls selling food items would need to obtain a Food Stall Licence from SFA, except for those under SFA exemptions.\nA Singapore Citizen or Permanent Resident; 21 years old and above; Not debarred from holding a SFA hawker licence; Not a former assistant/nominee who was deregistered by NEA; Not banned by the Government/Statutory Boards from taking part in any business tenders; Not renting or a joint operator of two cooked food stalls in markets/hawker centres managed by NEA.\nVisit GoBusiness to find out about the required licences/certifications. After obtaining a hawker stall, depending on your stall type and type of item sold, you may be required to obtain relevant licences and/or certifications through GoBusiness.\nIf you are operating a cooked food stall, you must obtain the Food Safety Course Certificate before the Food Stall Licence can be issued to you.\nURL: https://www.nea.gov.sg/our-services/hawker-management/becoming-a-hawker",
  "A tobacco retail licence is issued specifically to a particular outlet. If you operate more than one outlet, please make a separate application for each outlet. You are allowed to start retail sales when your licence application is approved. Licences are non-transferrable between companies / outlets.\nA tobacco retail licence is required to sell tobacco products.\nIndividuals above MLA who have not committed the offence of selling tobacco products to minors and companies registered with ACRA or licensed by SFA to retail food and beverages.\nGo to the GoBusiness Licensing website for easy online application. An email notification will be sent once the application is approved or rejected.\nDocuments required include NRIC of applicants and tenancy agreement or lease. Maximum upload file size is 2MB for each supporting document.\nURL: https://www.hsa.gov.sg/tobacco-regulation/licences/retail/apply"
]